{
  "articleTitle": "تفاصيل تدريب المصرية للاتصالات",
  "date": "١٠ يوليو ٢٠٢١",
  "p1": "لا شك أن ألياف البصريات وتقنياتها قد نقلت العالم إلى أنظمة اتصال أسرع وأكثر أمانًا بكثير، سواءً فيما يتعلق بالنقل أو خدمات الراديو والتلفزيون أو حتى الإنترنت.",
  "p2": "إذا نظرنا إلى الوراء إلى الأيام القديمة، سنجد أن سرعة الإنترنت كانت لا تُقارن بسرعات ومعدلات الساعة في الأيام الحالية، وذلك بفضل التقنيات الجديدة التي نجحت في تطبيق شبكات الألياف البصرية بدلاً من الشبكات القديمة القائمة على النحاس.",
  "p3": "في الواقع، إذا حاولنا التركيز أكثر سنجد أن الإنترنت وشبكات الكمبيوتر في الوقت الحالي تعتمد تمامًا على أنظمة الاتصال ونقل البيانات باستخدام شبكات فيزيائية تتكون من أسلاك قائمة على النحاس أو كابلات ألياف بصرية.",
  "p4": "أصبح أهمية شبكات الألياف البصرية واضحة عندما ازداد حجم البيانات بشكل هائل، وزاد الطلب على الأداء العالي والتطبيقات مثل الألعاب عبر الإنترنت والعمل الحر، وما إلى ذلك. كل هذا أدى إلى احتياج المستخدمين إلى عرض نطاق إكبر بكثير لتبادل وتحميل وتنزيل البيانات. ولا يمكن القيام بذلك دون شبكة مستقرة وقوية.",
  "p5": "كانت الكابلات النحاسية تواجه دائمًا مشكلة فيما يتعلق بعرض النطاق الترددي ونقل البيانات على مسافات طويلة. في هذه النقطة كان علينا أن نبحث عن كابلات أقوى قادرة على حمل مزيد من عرض النطاق الترددي بسرعة أعلى، وهذا ما سأقوم بشرحه في هذا المقال.",
  "i1": {
    "title": "",
    "alt": "جدول يوضح مقارنة بين ألياف البصرية والنحاس.",
    "description": "مقارنة بين كابلات النحاس وألياف البصرية."
  },
  "p6": "الميزة الأساسية التي تجعل كابل الألياف البصرية يهيمن على كابل النحاس هي سرعته. كما نعلم جميعًا أن سرعة الضوء هي أعلى سرعة في كوننا وفقًا لنظرية النسبية لألبرت أينشتاين، بسرعة ثابتة قدرها 300000 كم/ث في الفراغ، مقارنة بسرعة الإلكترون عبر الموصل التي تبلغ حوالي 2200 كم/ث. نجد أن هناك فارقًا هائلًا، وإذا تمكنا من إيجاد نظام يعتمد على سرعة الضوء لنقل البيانات، فسيكون هناك تحرك كبير في عالم نقل البيانات والاتصالات، وهذا هو ببساطة \"كابلات الألياف البصرية\".",
  "p7": "كما ذكرنا أعلاه، يعتمد كابل الألياف البصرية على سرعة الضوء، مما يعني ببساطة نقل إشارة ضوئية.",
  "p8": "المكونات الأساسية لنظام الاتصال البصري هي:",
  "i2": {
    "title": "",
    "alt": "شكل يوضح كيفية انتقال الإشارات عبر كابلات الألياف من المرسل إلى المستقبل.",
    "description": ""
  },
  "h3_1": "مزايا ألياف البصرية على الكابلات النحاسية",
  "ol1": "زيادة كبيرة في عرض النطاق والقدرة.///انخفاض في تشتت الإشارة (الخسارة).///لا تداخل الإشارات.///معدلات أخطاء البت المنخفضة.///صعوبة التنصت.///لا تداخل elektromagnetik.///مناعة للحقول الكهربائية.///تقليل حجم ووزن الكابلات.///حماية بيئية.///مقاومة للإشعاع (الإشعاع الغاما) والتآكل.///مقاومة للتغييرات في درجة الحرارة.///تكلفة منخفضة.",
  "h3_2": "تطبيقات الألياف البصرية",
  "ol2": "شبكات الكمبيوتر.///خطوط الهاتف.///التطبيقات الطبية.///الاتصالات تحت الماء.///محطات الطاقة.///التطبيقات العسكرية.",
  "h2_1": "طبيعة الضوء",
  "p9": "غالبًا ما يتم وصف الضوء بإحدى ثلاث طرق:",
  "h2_2": "1- الأشعة",
  "p10": "في الفيزياء التقليدية التي تعلمناها في المدرسة، كان الضوء يتكون من \"أشعة\" يمكن أن تنعكس وتنكسر من خلال المرايا والمنشورات وما إلى ذلك. هذا وصف جيد فيما يتعلق بما يمكن أن يكون لكنه لا يمكنه شرح العديد من الظواهر التي نستخدمها في الاتصالات البصرية.",
  "i3": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_3": "2- الفوتونات",
  "p11": "في العديد من السياقات، يتصرف الضوء وكأنه يتألف من جسيمات صغيرة تُعرف باسم \"الفوتونات\".",
  "h2_4": "3- الموجات الكهرومغناطيسية",
  "p12": "الضوء هو شكل من أشكال الطاقة الكهرومغناطيسية. ولكن ما هي الطاقة الكهرومغناطيسية؟ يتم إطلاق الطاقة الكهرومغناطيسية من أي جسم يكون لديه درجة حرارة تزيد على الصفر المطلق (–273 درجة مئوية)، مما يعني أن الذرات في الجسم في حالة حركة. تلتقط الإلكترونات التي تدور حول الذرات الطاقة من الحركة، وتتسبب الطاقة في نقلها إلى مدارات أعلى، أو مستويات طاقة أعلى. عندما تعود إلى مستويات طاقتها الأصلية، تطلق الطاقة مرة أخرى. الطاقة تأخذ شكلين: مجال كهربائي ومجال مغناطيسي، يتشكلان عند زوايا مستقيمة إلى بعضهما البعض وعلى زاوية مستقيمة إلى مسارهما، كما هو موضح في الشكل.",
  "i4": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p13": "أطوال الموجات الأكثر استخدامًا لألياف البصرية تقع في نطاق الأشعة تحت الحمراء، بقيم 850 نانومتر، 1310 نانومتر و1550 نانومتر.",
  "p14": "نطاق الطيف لهذه الأطوال الموجية يوفر تركيبة مهمة من الخصائص:",
  "p15": "إنها تكفي لجعل معدلات البيانات العالية ممكنة، ولكنها منخفضة بما يكفي للحاجة إلى طاقة نقل منخفضة نسبيًا على مسافات طويلة.",
  "i5": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p16": "تم اختيار تلك الأطوال الموجية بأنها توفر أعلى معدلات بيانات بأقل استهلاك للطاقة.",
  "p17": "سرعة الضوء في وسط معين تعتمد على معامل الانكسار لهذا الوسط، نجد أن سرعة الضوء قابلة للتغيير اعتمادًا على الوسط.",
  "p18": "v = c / n",
  "p19": "حيث: n هو معامل الانكسار للمادة، و c هي سرعة الضوء في الفراغ، و v هو سرعة الضوء عبر المادة.",
  "p20": "وهذا الشكل يوضح سرعة الضوء عبر وسائط مختلفة.",
  "i6": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_5": "بنية الألياف البصرية:",
  "p21": "لكن ما هي فعلياً بنية كابل الألياف البصرية؟",
  "p22": "يتألف كابل الألياف البصرية من ثلاثة مكونات:",
  "ol3": "النواة///الطبقة الخارجية///الغلاف",
  "ul_1": "يمكن اعتبار النواة عبارة عن قضيب صلب طويل مصنوع من الزجاج.///الطبقة الخارجية هي طبقة تُغلف حول النواة وهي أيضًا مصنوعة من الزجاج، بمعامل انكسار أصغر من النواة.///الغلاف هو طبقة حماية مصنوعة من البلاستيك لحماية من الغبار الخارجي والسوائل والضوء.",
  "i7": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p23": "لاحظ أن معامل الانكسار للطبقة الخارجية أكبر من معامل الانكسار للنواة. والشكل الموضح يظهر فقط النواة والطبقة الخارجية من دون الغلاف.",
  "i8": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_3": "الزاوية الحرجة:",
  "p24": "كما هو موضح في الشكل أعلاه، الزاوية الحرجة هي الزاوية التي يجب توجيه شعاع الضوء نحو النواة في بداية الكابل للبقاء على تفاعل داخلي كلي، يمكن حساب هذه الزاوية عبر العلاقة:",
  "p25": "θc = arcsine(n2 ÷ n1)",
  "p26": "مثال: إذا أردنا معرفة الزاوية الحرجة للألياف البصرية التي تحتوي على معامل انكسار للنواة n1 = 1.51 ومعامل انكسار للطبقة الخارجية n2 = 1.46:",
  "p27": "θc = arcsine(1.46 ÷ 1.51) = 75.211°",
  "h2_6": "أنواع الألياف البصرية:",
  "h3_4": "1- ألياف بصرية واحدة الوضع:",
  "p28": "الألياف ذات الوضع الواحد هي نوع من الألياف البصرية المستخدمة للاتصال على مسافات طويلة. ومن الاسم يمتلك نمط واحد فقط (شعاع ضوء واحد بطول موجي واحد) مزايا ألياف البصرية ذات الوضع الواحد على النحو التالي:",
  "ol4": "تُستخدم لنقل البيانات والاتصال بين تبادلات مختلفة.///تُستخدم للمسافات الطويلة حيث يكون تشتت الإشارة أقل من الوضع المتعدد.///تحمل شعاع ضوء واحد.///الجهاز الذي ينتج هذا الشعاع من الضوء يتكون بشكل أساسي من ثنائي القطب الليزري، ولذلك فهو وضع واحد.///قطر الألياف ذات الوضع الواحد هو 250 ميكرومتر مع نواة بقطر 9 ميكرومتر وطبقة خارجية بقطر 125 ميكرومتر وغلاف بقطر 250 ميكرومتر.",
  "h3_5": "2- ألياف بصرية متعددة الوضع:",
  "p29": "عادةً ما تستخدم ألياف البصرية متعددة الوضع للاتصال على مسافات قصيرة، وكما هو موضح في الوضع الواحد يمكن أن تكون لها أوضاع متعددة (أشعة ضوء بأطوال موجية متعددة)، ومزايا ألياف البصرية متعددة الوضع على النحو التالي:",
  "ol5": "تُستخدم لنقل البيانات والاتصال فقط على مسافات قصيرة مثل بين الخزانة والعميل، عادةً أقل من 2 كيلومتر.///تُستخدم للمسافات القصيرة حيث يكون تشتت الإشارة أكثر من الوضع الواحد.///يمكن أن تحمل شعاع ضوء متعدد مع أطوال موجية متعددة.///الجهاز الذي ينتج هذه الأشعة من الضوء يتكون أساسًا من ثنائي القطب المشع.///قطر ألياف البصرية متعددة الوضع هو 250 ميكرومتر مع نواة بقطر 50-62 ميكرومتر، وغلاف بقطر 250 ميكرومتر.",
  "h2_7": "التشتت",
  "p30": "هناك ثلاثة أسباب تسبب التشتت داخل الألياف البصرية:",
  "h3_6": "الامتصاص",
"p31": "جميع المواد، حتى أنقى أنواع الزجاج، تمتص بعض الضوء. تعتمد كمية الامتصاص على نوع المادة وطول موجة الضوء المارة من خلالها.",
"i9": {
"title": "",
"alt": "",
"description": ""
},
"h3_7": "التشتيت",
"p32": "يتسبب التشتت في تغيير اتجاه الضوء الذي يصيبه الهياكل الذرية والجسيمات داخل الألياف، كما هو موضح في الشكل.",
"i10": {
"title": "",
"alt": "",
"description": ""
},
"h3_8": "خسائر الانحناء",
"ul_2": "الانحناء الصغير",
"i11": {
"title": "",
"alt": "",
"description": ""
},
"ul_3": "الانحناء الكبير",
"i12": {
"title": "",
"alt": "",
"description": ""
},
"h2_8": "إجمالي التشتت",
"p33": "إجمالي التشتت هو مجموع تأثيرات الامتصاص والتشتت في الألياف.",
"p34": "أولاً، يجب أن نعرف مفهوم التشتت، حيث يعني في الألياف البصرية فقدان الطاقة اعتمادًا على معلمات مختلفة عبر الكابل من التبادل إلى العميل.",
"p35": "لنأخذ بعض المعلمات التي نفقد عبرها الطاقة على طول المسار:",
"ol6": "كل نقطة انصهار لها تشتت تقريبي يبلغ 0.1 ديسيبل///تعتمد تشتت الكيلومتر على الطول الموجي الذي نستخدمه.///على كل 4 كيلومتر يجب أن يكون لدينا نقطة انصهار، لأن لفائف الألياف البصرية مصنوعة بطول 4 كيلومترات، وبالتالي يجب أن يكون لدينا نقطة انصهار كل 4 كيلومترات.///كل موصل على الألياف لديه تشتت أقصى بقيمة 0.5 ديسيبل///كل وحدة توزيع بصرية لديها تشتت بقيمة 3.5 ديسيبل///أخيراً، كل مُقسِّم لديه تشتت يعتمد على عدد المنافذ الواردة : المنافذ الصادرة، على سبيل المثال:",
"ulx_1": "مقسم بنسبة 1 : 2 له تشتت = 3.5 ديسيبل///مقسم بنسبة 1 : 4 له تشتت = 7 ديسيبل///مقسم بنسبة 1 : 8 له تشتت = 10.5 ديسيبل///مقسم بنسبة 1 : 16 له تشتت = 14 ديسيبل///مقسم بنسبة 1 : 32 له تشتت = 17.5 ديسيبل",
"p36": "مجموع قيم التشتت هذه يعطينا إجمالي التشتت على الشبكة عبر الكابل.",
"h2_9": "مكونات موصل الألياف البصرية",
"p37": "تتمثل مهمة موصل الألياف البصرية في ربط نهاية الألياف ميكانيكيًا بجهاز أو بأخرى أو بأخرى بحيث تتوازن النوى بدقة وتنتج أقل كمية من الخسارة.",
"i13": {
"title": "",
"alt": "",
"description": ""
},
"h2_10": "الهندسة",
"p38": "الهندسة تشير إلى شكل نهاية السدادة الفيرول كما هو موضح:",
"i14": {
"title": "",
"alt": "",
"description": ""
},
"p39": "وهناك العديد من أنواع الموصلات بناءً على الهندسة وحجم الجسم والغطاء.",
"p40": "وإليكم مختلف أنواع موصلات الألياف البصرية:",
"i15": {
"title": "",
"alt": "",
"description": ""
},
"h2_11": "ربط الألياف البصرية",
"p41": "عندما نقوم بربط كابلي ألياف بصرية، يجب التأكد من أن السلالم الاثنين المراد ربطهما لديهما نفس الخصائص من حيث قطر النواة والعودة، وقطر النهاية الكلي، ومعامل الانكسار هما نفسهما، وأهم شيء هو أن يكونا مستويين (مقصوصين بزاوية 90 درجة على خط الوسط الذي يفصل الكابلين) وخاليين من الغبار والدخان.",
"h3_9": "مقشة الألياف البصرية",
"p42": "تُستخدم هذه المعدات لتجريف ألياف الألياف البصرية وإزالة طبقة الغلاف من الألياف المختلفة المراد ربطها.",
"i16": {
"title": "",
"alt": "",
"description": ""
},
"h3_10": "المشقة البصرية",
"p43": "تُستخدم هذه المعدات لقطع طرفي السلالم الاثنين المراد ربطهما بدقة دون زوايا قطع، ودون قطع سيء.",
"i17": {
"title": "",
"alt": "",
"description": ""
},
"p44": "وهكذا يمكن أن تكون عملية القطع:",
"i18": {
"title": "",
"alt": "",
"description": ""
},
"p45": "يجب أن يكون طول القسم المقصوص بعد طبقة الغلاف حوالي 20 مم إلى 15 مم.",
"h2_12": "معدات الربط",
"p46": "هدف أي ربط للألياف البصرية هو توصيل نهايتين من الألياف بشكل دائم مع أقل فقدان في الجودة البصرية ممكن.",
"p47": "يمكن ربط الألياف البصرية باستخدام طريقتين: الربط الميكانيكي وربط الانصهار.",
"h3_11": "موصلات ميكانيكية",
"p48": "تستخدم الموصلات الميكانيكية أنبوبًا بلاستيكيًا يحتوي على آلية قفل تُحكم الألياف الاثنين ضد بعضهما لتكوين ربط، كما هو موضح في الشكل.",
"i19": {
"title": "",
"alt": "",
"description": ""
},
"p49": "يتم الاحتفاظ بنهايتي الربط بشكل دائم في المثبت المعروض.",
"p50": "هذه الطريقة للربط تعاني من فقدان أكبر من الربط بناءً على الانصهار وغالبًا ما تكون الموصلات الميكانيكية غير مكلفة ولكنها تفتقر إلى الميزات.",
"h3_12": "موصلات الانصهار",
"p51": "تقوم موصلات الانصهار بإنشاء ربط دائم عن طريق لحام نهايتي الألياف معًا باستخدام قوس كهربائي. ثم يتم إغلاق الربط في أنبوب تقليص الحرارة مع فرن مدمج في الموصلة. يوضح الشكل التالي موصل الانصهار:",
"i20": {
"title": "",
"alt": "",
"description": ""
},
"p52": "عادةً ما تكون موصلات الانصهار مكلفة وتكلف آلاف الدولارات، ولديها المزيد من الميزات من الموصلات الميكانيكية، ولديها آلية توجيه تلقائية للألياف الاثنين، ولديها صور وفيديوهات ذات دقة عالية للنهايتين أثناء الربط، ويمكنها حساب قيمة التشتت بعد الربط كما هو موضح.",
"i21": {
"title": "",
"alt": "",
"description": ""
},
"h2_13": "إجراءات الربط",
"p53": "نظرًا لأن ربط الانصهار أكثر فعالية من الربط الميكانيكي وأكثر دقة، وأكثر شيوعًا عندما يتعلق الأمر بشبكات الاتصال ذات الوضع الواحد والمسافات الطويلة، سنقوم بشرح إجراءاته بالتفصيل:",
"h3_13": "إجراءات ربط الانصهار",
"p54": "تحتوي العديد من موصلات الانصهار على ميزة توضيب الألياف تلقائيًا في العلاقة المناسبة مع بعضها البعض ومع الكترودات للحصول على أفضل ربط ممكن. كل ما يلزم من المشغل هو تجهيز الألياف بشكل صحيح ووضعها في الجهاز.",
"p55": "لاستعداد لربط الانصهار، على النحو الذي يتم استخدامه للربط الميكانيكي، تأكد من أن منطقة العمل نظيفة وجافة ومُضاءة بشكل جيد. قم بتجميع الأدوات التالية قبل البدء:",
"ulx_2": "أداة ربط الانصهار///قاطع طلاء بلاستيكي///كحول إيزوبروبيلي ذو درجة عالية///مناديل خالية من الشوائب///مقشة///أنبوب تقليص الحرارة",
"p56": "بمجرد تجميع موادك، قم باتباع الخطوات التالية:",
"h3_14": "الإعداد",
"ul_4": "1. قم بفتح أنابيب حماية الألياف وكشف وتنظيف الألياف.///2. قم بتمكين التيار لجهاز ربط الانصهار.",
"h3_15": "تجهيز الألياف",
"ul_5": "3. قم بإزالة الطول الأدنى من الألياف المطلوب لتجهيزها وربطها - أقل من حلقة واحدة إذا كان ذلك ممكنًا.///4. قم بتمرير أنبوب تقليص الحرارة فوق نهاية الألياف وحركه بما يكفي لأعلى لتجعله خارج الطريق.///5. قم بتجريد طلاء البلاستيك بطول 1 إلى 2 بوصة (25 مم إلى 51 مم) من الألياف باستخدام قاطع طلاء ميكانيكي.///6. قم بتنظيف الزجاج العاري عن طريق سحب الألياف من خلال منديل مشبع بالكحول خالي من الشوائب. يتم ذلك لإزالة أي شظايا أو أوساخ متبقية على الألياف.///7. اقطع الألياف إلى الطول المحدد بواسطة علامة الربط التي تستخدمها، والذي يبلغ عادةً 12-14 مم ± 0.5 مم. ملاحظة: يجب أن تكون نهايات القطع ضمن زاوية 2 درجة من العمود على محور الألياف ويجب أن تكون خالية من العيوب.",
"h3_16": "تجميع الربط",
"ul_6": "8. ضع نهاية الألياف في الوحدة بجوار الكترود وأغلق مشبك الألياف بجوار الكترود.///9. أغلق المشبك الخارجي على الألياف.///10. كرر الخطوات 7 و 8 للنهاية الأخرى للربط.///11. أغلق غطاء الكترود.///12. حدد برنامج الربط المناسب في الكمبيوتر التحكمي للربط وقم بتفعيله. يقوم جهاز الربط بأداء التعديلات والتوجيه اللازمة، وينفذ الربط، ويقيس الفقدان عبر الربط. يمكن مشاهدة العملية من خلال شاشة العرض الفيديو، إذا كانت متاحة، كما هو موضح في الشكل.",
"i22": {
"title": "",
"alt": "",
"description": ""
},
"h3_17": "محدد الأعطال المرئي",
"h2_14": "قياس الألياف البصرية",
"p57": "يمكن أن يكون محدد الأعطال المرئي منفصلًا أو مدمجًا في جهاز القياس بالتوقيت المنطقي للعودة الزمنية البصرية. إنه جهاز يُحقن شعاعًا ضوئيًا داخل الألياف لتتبع تغييرات الشعاع وتحديد المناطق الملتوية الدقيقة أو الكسور كما هو موضح في الشكل.",
"i23": {
"title": "",
"alt": "",
"description": ""
},
"i24": {
"title": "",
"alt": "",
"description": ""
},
"h3_18": "جهاز القياس بالتوقيت المنطقي للعودة الزمنية البصرية (OTDR)",
"p58": "المعلومات التي يمكن قياسها",
"ol7": "التحويل.///موقع الأعطال، حسب مسافتها عن نقطة البداية.///التحويل بالنسبة للمسافة (ديسيبل/كيلومتر).///الانعكاسية لحدث انعكاسي أو رابط.",
"p59": "هدف هذا الجهاز هو اكتشاف وتحديد وقياس الأحداث في أي مكان في رابط الألياف.",
"p60": "يعتمد جهاز القياس بالتوقيت المنطقي للعودة الزمنية البصرية على ظاهرة تشتت الضوء داخل الألياف البصرية وينشئ علاقة تصف سلوك الضوء داخل الألياف بناءً على العلاقة بين التحويل والمسافة كما هو موضح:",
"i25": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "p61": "عندما يصل الضوء إلى نهاية الكابل، يقوم بالتردد الذي يظهر في نهاية هذه المؤامرة، مشيرًا إلى أنها نهاية كابل الألياف.",
  "h1_1": "الهرم الرقمي المتجانس",
  "p62": "في أوائل السبعينيات من القرن الماضي، بدأت أنظمة النقل الرقمي تظهر، باستخدام طريقة تعرف باسم تعديل التعليمات بالنبضات (PCM)، التي اقتُرحت لأول مرة في عام 1937. أتاحت التعليمات بالنبضات التمثيل الثنائي للموجات التناظرية، مثل صوت الإنسان، في شكل ثنائي.",
  "h2_15": "مبادئ تكثيف PDH",
  "p63": "يتم الحصول على إشارات PDH ذات معدل نقل أعلى من خلال تكثيف العديد من الإشارات ذات المعدل الأدنى.",
  "h3_19": "عملية التكثيف",
  "p64": "تجمع أربعة إشارات مدخلات بنفس معدل البت القياسي لتشكيل إشارة تكثيف واحدة ثم تمرر إلى الجانب الاستقبالي عبر مسار نقل مشترك واحد.",
  "h3_20": "عملية فك التكثيف",
  "p65": "في الجانب الاستقبالي، يتم توزيع الإشارة المجمعة مجددًا على المخرجات المقابلة.",
  "i26": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "p66": "الشكل أعلاه يوضح عملية التكثيف لـ CEPT، وهي الطريقة القياسية لتكثيف أوروبا.",
  "p67": "كما أظهرنا، فإن مصطلح PDH هو اختصار لـ Plesiochronous Digital Hierarchy، وهو إطار يستخدم مزيجًا من الدوائر الإلكترونية لإرسال البيانات على شكل أنماط بت من الأصفار والواحدات، وهو يستخدم قناة بمعدل 1/8000 من الثانية لإرسال البيانات، ويتألف من 32 فتحة، حيث تحتوي كل فتحة على 8 بت. إذا جمعنا كل هذا سيكون لدينا (8000 ثانية × 32 فتحة × 8 بت = 2.048 ميجابت في الثانية) وهو معدل الساعة لهذا الإطار.",
  "p68": "من خلال تكثيف الإطارات بمعدل بت 2.048 ميجابت في الثانية، سنتمكن من الحصول على معدل أعلى لـ PDH كما هو موضح في الشكل.",
  "p69": "يجب تنفيذ هذا العمل على الجانب الإرسالي، ولكن عندما يأتي الأمر إلى الاستقبال، يجب أن يكون هناك عملية عكسية لفك التكثيف لقراءة البيانات.",
  "i27": {
  "title": "",
  "alt": "",
  "description": "هذا هو النظام المستخدم من قبل CEPT للحصول على معدل نقل عالي. كل سهم ذو اتجاهين يمثل إطار PDH."
  },
  "h2_16": "بنية إطار إشارة PDH",
  "p70": "كل إشارة ضمن مستوى الهرم CEPT لها بنية إطار محددة تتألف أساسًا من الكتل التالية:",
  "i28": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "h2_17": "تكثيف / فك تكثيف إشارات PDH",
  "p71": "يمكن تكثيف PDH باستخدام تكثيف بت مع بت كما هو موضح أدناه:",
  "i29": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "p72": "كما يوضح الأمر، فإن مهمة المضاعف هي إضافة الإطارين في إطار واحد، ويجب أن يكون لهذا الإطار الجديد معدل نقل يعادل مجموع إطاري I و II معًا. نجح المعيار CEPT في الوصول إلى أعلى معدل نقل باستخدام التكثيف والذي يبلغ 140 ميجابت في الثانية.",
  "h2_18": "سلبيات PDH",
  "p73": "كانت هناك بعض السلبيات في استخدام PDH، أولاً وقبل كل شيء نقص المرونة، ببساطة، لا يمكننا استخراج معدل أدنى محدد إذا كنا نرغب في توفير قناة واحدة بمعدل 2 ميجابت في الثانية للعميل على سبيل المثال. من أجل الوصول إلى خط 2 ميجابت في الثانية واحد يجب أن يتم فك تكثيف القناة 140 ميجابت في الثانية بالكامل إلى 64 خطًا مكونًا لـ 2 ميجابت في الثانية عبر 34 و 8 ميجابت في الثانية. بمجرد تحديد واستخراج الخط 2 ميجابت في الثانية المطلوب، يجب أن تعادل القنوات مجددًا للوصول إلى 140 ميجابت في الثانية.",
  "p74": "سلبية أخرى لـ PDH هي عدم قدرتها على توفير توبولوجيات مختلفة، حيث يمكنها فقط توفير توبولوجية نقطة إلى نقطة بسيطة.",
  "p75": "آخر سلبية هي أنها لم تكن متزامنة، وبالتالي كانت تواجه بعض المشاكل عندما يتعلق الأمر بتكثيف الإطارات معًا، حيث يفترض المضاعف أن جميع مداخله يتم تشغيلها في نفس الوقت، بشكل أوضح، يجب إضافة آخر بت على اليمين داخل كل إطار إلى البت المعادل في الإطار الآخر. يمكننا حل ذلك باستخدام حاوية تحتوي على معدل أعلى من كل إطارات الإدخال، وهذه مهمة هذه الحاوية هي سد جميع البتات الناتجة عن الفرق بين هذه الحاوية وكل إطار، تلك البتات تسمى بتات السد، ويعتمد PDH بشدة على بتات السد. وهذا يشكل مشكلة أخرى، لأن بتات السد تمتلئ بالسخام الذي لا يؤدي أي دور في الجانب الذي يفك تكثيفه، باستثناء احتلال المساحة داخل الإطار.",
  "h1_2": "الهرم الرقمي المتجانس",
  "p76": "الميزة الرئيسية لنظام الهرم الرقمي المتجانس هي القدرة على التزامن، وهذه ميزة لم تتمكن PDH من تحقيقها، حيث يحتوي كل إطار في PDH على معدل ساعة خاص به، أو بعبارة أخرى، مولد ساعته الخاص، وهذا هو السبب في أن PDH كانت تعاني من معدلات ساعة مختلفة.",
  "p77": "ولكن إذا كان بإمكاننا إنشاء نظام يحتوي على مولد ساعة مرجعي، سنحصل على معدل ساعة موحد لجميع الإطارات التي ستكون قابلة للتكثيف، وبالتالي سنتمكن من التخلص من بتات السد.",
  "p78": "ميزة أخرى لنظام SDH هي هيكله، حيث يتكون من 9 صفوف، حيث يحتوي كل صف على 270 فتحة، ولكل فتحة 8 بت. وبالتالي، العدد الإجمالي للبتات في الإطار SDH = 9 * 270 * 8 = 19440 بتًا.",
  "p79": "حتى الآن كل شيء على ما يرام، دعونا الآن نحاول أن نجد معدل الأساس لهذا الإطار. كما نعلم، يتم تكرار الإطار مثل إطار PDH 8000 مرة في الثانية، لذلك إذا قمنا بضرب عدد البتات في 19440 × 8000 = 155.52 ميجابت في الثانية.",
  "p80": "قدرت الاتحاد الدولي للاتصالات على إشارة أساسية، STM-1 (وحدة النقل المتزامنة - 1) بمعدل 155.520 ميجابت في الثانية. جميع مستويات التكثيف في SDH هي ضعاف صحيحة مضاعفة لهذه الإشارة الأساسية 'STM-1' كما هو موضح أدناه:",
  "i30": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "p81": "هذه ببساطة هي معدلات إطارات SDH، بدءًا من معدل الأساس، متجهين نحو الأعلى من خلال تكثيف الإطارات معًا.",
  "p82": "ملاحظة: STM-4 هو 4 ضعف لإطار STM-1، وبالمثل، STM-64 هو 16 ضعف لـ STM-4 والعكس بالعكس.",
  "p83": "التمثيل ثنائي الأبعاد لإطار STM-1 يتضمن 9 صفوف، حيث يحتوي كل صف على 270 بايتًا كما هو موضح:",
  "i31": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "p84": "إطار STM-1 يتألف من ثلاثة مكونات:",
  "i32": {
  "title": "",
  "alt": "",
  "description": ""
  },
  "ulx_3": "مؤشر (PTR): يشير إلى عنوان بداية المعلومات الفرعية.///سوهو (SOH): سعة نقل إضافية.///حمولة: معلومات الفرعية.",
  "p85": "يُستخدم 'سوهو' و 'مؤشر' للإدارة، والحمولة تُستخدم للبيانات.",
  "p86": "يتم نقل الإطارات في فترات زمنية قدرها 125 ميكروثانية. يتم تكرار إطار STM-1 (1 ثانية: 125 ميكروثانية) = 8000 مرة في الثانية. بالتالي، يحمل كل بايت في إطار STM-1 سعة نقل تبلغ 8000 × 8 = 64 كيلوبت في الثانية، كما ذُكر سابقًا في إطار PDH.",
  "p87": "ميزة أخرى لـ SDH على PDH هي استخدام تكثيف البايت بواسطة البايت، على عكس PDH التي تستخدم تكثيف البت بواسطة البت.",
  "p88": "لفهم أفضل، تم شرح إنشاء إطار STM-4 هنا باستخدام إطارين STM-1 فقط، على الرغم من أنه في الواقع يتم تكثيف 4 إطارات STM-1.",
"i33": {
"title": "التكثيف باستخدام بايت بواسطة البايت.",
"alt": "التكثيف باستخدام بايت بواسطة البايت.",
"description": "التكثيف باستخدام بايت بواسطة البايت."
},
"h2_19": "ملخص",
"h2_20": "مبادئ تكثيف PDH",
"ul_7": "معدلات البت وفقًا للنصوص CEPT: 2 ميجابت/ث، 8 ميجابت/ث، 34 ميجابت/ث و 140 ميجابت/ث.///لكل إشارة هناك هيكل إطار منفصل.///يعتمد PDH على تكثيف البت باستخدام البت.///لا يوجد تزامن إطار لمداخل الإشارة الفرعية.///تكون إشارات المداخل للإشارات الفرعية متزامنة على نحو متقارب، بمعنى آخر، تكون معدلات ساعاتها لها القيمة الاسمية نفسها، ولكن هناك قدرًا طفيفًا من التباين بينهما.",
"h2_21": "مبادئ تكثيف SDH",
"ul_8": "معدلات البت التي تزيد على 140 ميجابت/ث تم توحيدها على أساس عالمي، على عكس PDH.///يمكن أن يكون التشغيل المتزامن والتشغيل المتزامن متزامنًا ممكنًا.///يمكن نقل جميع إشارات PDH الحالية (CEPT/ANSI) داخل SDH (باستثناء 8 ميجابت/ث).///بايتات 'سوهو' توفر سعة نقل عالية لمهام المراقبة والصيانة والتحكم.///تكون إشارات التكثيف عالية المستوى مضاعفات صحيحة لمعدل البت الأساسي (155,520 ميجابت/ث).///للمرة الأولى، تم توحيد رمز الخط البصري على نطاق عالمي."
}
