{
  "articleTitle": "Telecom Egypt Praktikumsdetails",
  "date": "10. Juli 2021",
  "p1": "Kein Zweifel, dass optische Fasern und ihre Technologien die Welt zu wesentlich schnelleren und sichereren Kommunikationssystemen gebracht haben, sei es in Bezug auf Übertragung, Radio- und TV-Dienste oder sogar das Internet.",
  "p2": "Wenn wir in die alten Zeiten zurückblicken, stellen wir fest, dass die Internetgeschwindigkeit im Vergleich zu den heutigen Geschwindigkeiten und Taktzahlen nicht vergleichbar war. Dies liegt an neuen Technologien, die es geschafft haben, optische Glasfasernetze anstelle der alten kupferbasierten Netzwerke einzuführen.",
  "p3": "Tatsächlich könnten wir, wenn wir uns mehr konzentrieren würden, feststellen, dass das heutige Internet und Computernetzwerke vollständig auf Kommunikationssystemen und der Übertragung von Daten über physische Netzwerke angewiesen sind, die aus kupferbasierten Kabeln oder optischen Glasfaserkabeln bestehen.",
  "p4": "Die Bedeutung von optischen Glasfasernetzen wurde hervorgehoben, als die Daten enorm gewachsen sind und die Nachfrage nach hoher Leistung und Anwendungen wie Online-Spielen und Freelancing, etc. All dies führte dazu, dass Benutzer viel mehr Bandbreite benötigen, um Daten auszutauschen, hochzuladen und herunterzuladen. Und das kann ohne ein stabiles und leistungsstarkes Netzwerk nicht erreicht werden.",
  "p5": "Kupferkabel hatten immer einen Engpass, wenn es um Bandbreite und die Übertragung von Daten über große Entfernungen ging. An diesem Punkt mussten wir stärkere Kabel finden, die in der Lage sind, mehr Bandbreite mit höherer Geschwindigkeit zu übertragen, was ich in diesem Artikel erläutern werde.",
  "i1": {
    "title": "",
    "alt": "Eine Tabelle, die einen Vergleich zwischen Glasfaser und Kupfer zeigt.",
    "description": "Vergleich zwischen Kupfer- und Glasfaserkabeln."
  },
  "p6": "Der grundlegende Vorteil, der ein optisches Glasfaserkabel gegenüber einem Kupferkabel dominiert, ist seine Geschwindigkeit. Wie wir alle wissen, ist die Geschwindigkeit des Lichts die höchste Geschwindigkeit in unserem Universum gemäß Einsteins Relativitätstheorie, mit einer konstanten Geschwindigkeit von 300.000 km/s im Vakuum. Im Vergleich zur Geschwindigkeit eines Elektrons durch einen Leiter von etwa 2200 km/s stellen wir fest, dass es einen großen Unterschied gibt. Und wenn wir ein System finden könnten, das auf der Geschwindigkeit des Lichts basiert, um Daten zu übertragen, gäbe es eine große Bewegung in der Welt der Datenübertragung und Kommunikation, das sind einfach 'Optische Glasfaserkabel'.",
  "p7": "Wie oben erwähnt, hängt ein optisches Glasfaserkabel von der Geschwindigkeit des Lichts ab, was bedeutet, dass es einfach Lichtsignale überträgt.",
  "p8": "Die grundlegenden Komponenten eines optischen Kommunikationssystems sind:",
  "i2": {
    "title": "",
    "alt": "Eine Abbildung, die zeigt, wie Signale von Sender zu Empfänger durch Glasfaserkabel verlaufen.",
    "description": ""
  },
  "h3_1": "Vorteile von Glasfaser gegenüber Kupferkabeln",
  "ol1": "Deutlich erhöhte Bandbreite und Kapazität.///Geringere Signalabschwächung (Verlust).///Keine Übersprechungen.///Geringere Bitfehlerraten.///Schwer abzuhören.///Keine elektromagnetischen Interferenzen.///Immunität gegen elektrische Felder.///Kleinere Größe und leichtere Kabel.///Umweltschutz.///Beständigkeit gegen Strahlung (Gammastrahlung) und Korrosion.///Beständigkeit gegen Temperaturschwankungen.///Geringe Kosten.",
  "h3_2": "Anwendungen von optischen Fasern",
  "ol2": "Computernetzwerke.///Telefonleitungen.///Medizinische Anwendungen.///Unterwasserkommunikation.///Kraftwerke.///Militärische Anwendung.",
  "h2_1": "Die Natur des Lichts",
  "p9": "Licht wird in der Regel auf eine von drei Arten beschrieben:",
  "h2_2": "1- Strahlen",
  "p10": "In der klassischen Physik, die viele von uns in der Schule gelernt haben, bestand Licht aus 'Strahlen', die durch Spiegel und Prismen reflektiert und gebrochen werden konnten, etc. Das ist eine gute Beschreibung, soweit sie geht, aber sie kann viele der Phänomene, die wir in der optischen Kommunikation nutzen, nicht erklären.",
  "i3": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_3": "2- Photonen",
  "p11": "In vielen Kontexten verhält sich Licht, als bestünde es aus winzigen Teilchen, die 'Photonen' genannt werden.",
  "h2_4": "3- Elektromagnetische Wellen",
  "p12": "Alle Lichtarten sind eine Form von elektromagnetischer Energie. Aber was ist elektromagnetische Energie? Elektromagnetische Energie wird von jedem Objekt emittiert, das eine Temperatur über dem absoluten Nullpunkt (–273° C) hat, was bedeutet, dass die Atome im Objekt in Bewegung sind. Die Elektronen, die die Atome umkreisen, nehmen Energie aus der Bewegung auf, und die Energie veranlasst sie, in höhere Orbits oder Energiezustände zu wechseln. Wenn sie wieder auf ihre ursprünglichen Energiezustände zurückfallen, geben sie die Energie wieder ab. Die Energie nimmt zwei Formen an: ein elektrisches Feld und ein Magnetfeld, die im rechten Winkel zueinander und im rechten Winkel zu ihrem Reiseweg stehen, wie in der Abbildung gezeigt.",
  "i4": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p13": "Die am häufigsten für Glasfaser verwendeten Wellenlängen liegen im Infrarotbereich mit Werten von 850 nm, 1310 nm und 1550 nm.",
  "p14": "Der Spektralbereich dieser Wellenlängen bietet eine wichtige Kombination von Eigenschaften:",
  "p15": "Es ist hoch genug, um hohe Datenraten zu ermöglichen, aber niedrig genug, um für die Übertragung über lange Strecken relativ wenig Leistung zu benötigen.",
  "i5": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p16": "Diese spezifischen Wellenlängen wurden gewählt, da sie die höchsten Datenraten bei niedrigem Energieverbrauch bieten.",
  "p17": "Die Geschwindigkeit des Lichts in einem Medium hängt vom Brechungsindex dieses Mediums ab, wir stellen fest, dass die Lichtgeschwindigkeit abhängig vom Medium veränderlich ist.",
  "p18": "v = c / n",
  "p19": "Wo: n der Brechungsindex des Materials ist, c die Lichtgeschwindigkeit im Vakuum ist und v die Geschwindigkeit des Lichts im Material ist.",
  "p20": "Und diese Abbildung zeigt die Lichtgeschwindigkeit durch verschiedene Medien",
  "i6": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_5": "Aufbau der optischen Faser:",
  "p21": "Aber wie ist eigentlich der Aufbau eines optischen Faserkabels?",
  "p22": "Ein optisches Faserkabel besteht aus drei Komponenten:",
  "ol3": "Kern///Mantel///Ummantelung",
  "ul_1": "Der Kern kann als sehr langer fester Stab aus Glas betrachtet werden.///Der Mantel ist eine um den Kern gewickelte Abdeckung und besteht ebenfalls aus Glas mit einem Brechungsindex kleiner als der des Kerns.///Die Ummantelung ist eine Schutzschicht aus Kunststoff zum Schutz vor äußerem Staub, Flüssigkeiten und Licht.",
  "i7": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p23": "Beachten Sie, dass der Brechungsindex des Mantels größer ist als der des Kerns. Die Abbildung zeigt nur den Kern und den Mantel ohne die Ummantelung.",
  "i8": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_3": "Der kritische Winkel:",
  "p24": "Wie in der obigen Abbildung dargestellt, ist der kritische Winkel der Winkel, unter dem der Lichtstrahl zu Beginn des Kabels zum Kern hin gerichtet sein sollte, um eine totale innere Reflexion zu haben. Dieser Winkel kann berechnet werden durch:",
  "p25": "θc = Arcsin(n2 ÷ n1)",
  "p26": "Beispiel: Wenn wir den kritischen Winkel einer optischen Faser mit einem Kern-Brechungsindex von n1 = 1,51 und einem Mantel-Brechungsindex von n2 = 1,46 wissen wollen:",
  "p27": "θc = Arcsin(1,46 ÷ 1,51) = 75,211°",
  "h2_6": "Arten von optischen Fasern:",
  "h3_4": "1- Singlemode-Optikfasern:",
  "p28": "Singlemode ist eine Art von optischen Fasern, die für Verbindungen über lange Strecken verwendet werden. Und wie der Name schon sagt, hat sie nur einen Modus (einen Lichtstrahl mit einer einzigen Wellenlänge). Die Vorteile von Singlemode-Optikfasern sind:",
  "ol4": "Sie wird für die Übertragung und Kommunikation zwischen verschiedenen Stellen verwendet.///Sie wird für lange Strecken verwendet, da sie eine geringere Dämpfung als Multimode aufweist.///Sie trägt einen einzigen Lichtstrahl.///Die Vorrichtung, die diesen Lichtstrahl erzeugt, besteht im Wesentlichen aus einer Laserdiode, und deshalb handelt es sich um einen einzelnen Modus.///Der Durchmesser einer Singlemode-Faser beträgt 250 μm mit einem Kern von 9 μm, einem Mantel von 125 μm und einer Ummantelung von 250 μm.",
  "h3_5": "2- Multimode-Optikfasern:",
  "p29": "Multimode-Optikfasern werden in der Regel für Verbindungen auf kurze Distanz verwendet, und wie bei Singlemode kann sie mehrere Modi haben (Lichtstrahlen mit mehreren Wellenlängen). Die Vorteile von Multimode-Optikfasern sind:",
  "ol5": "Sie wird für die Übertragung und Kommunikation nur auf kurze Distanzen wie zwischen dem Verteiler und dem Kunden verwendet, normalerweise weniger als 2 Kilometer.///Sie wird für kurze Strecken verwendet, da sie eine höhere Dämpfung als Singlemode aufweist.///Sie kann mehrere Lichtstrahlen mit verschiedenen Wellenlängen tragen.///Die Vorrichtung, die diese Lichtstrahlen erzeugt, besteht hauptsächlich aus einer LED (Light Emitting Diode).///Der Durchmesser einer Multimode-Faser beträgt 250 μm mit einem Kern von 50-62 μm und einer Ummantelung von 250 μm.",
  "h2_7": "Dämpfung",
  "p30": "Es gibt drei Gründe, die zu Dämpfung in einer optischen Faser führen:",
  "h3_6": "Absorption",
  "p31": "Alle Materialien, sogar das klarste Glas, absorbieren Licht in gewissem Maße. Die Menge der Absorption hängt vom Materialtyp und der Wellenlänge des durchdringenden Lichts ab.",
  "i9": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_7": "Streuung",
  "p32": "Streuung entsteht durch atomare Strukturen und Partikel in der Faser, die das einfallende Licht umlenken, wie in der Abbildung gezeigt.",
  "i10": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_8": "Biegeverluste",
  "ul_2": "Mikrobiege",
  "i11": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "ul_3": "Makrobiege",
  "i12": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_8": "Gesamtdämpfung",
  "p33": "Die Gesamtdämpfung ist die Kombination der Effekte von Absorption und Streuung in einer Faser.",
  "p34": "Zuerst sollten wir Dämpfung definieren. In optischen Fasern bedeutet Dämpfung den Leistungsverlust abhängig von verschiedenen Parametern entlang des Kabels vom Austausch bis zum Kunden.",
  "p35": "Betrachten wir einige Parameter, durch die wir Leistung auf dem Weg verlieren:",
  "ol6": "Jeder Verbindungspunkt hat eine ungefähre Dämpfung von 0,1 dB///Die Dämpfung pro Kilometer hängt von der verwendeten Wellenlänge ab.///Alle 4 Kilometer muss ein Verbindungspunkt vorhanden sein, da Glasfaserrollen mit einer Länge von 4 Kilometern hergestellt werden.///Jeder Stecker auf der Faser hat eine maximale Dämpfung von 0,5 dB///Jedes ODF (Optical Distribution Frame) hat eine Dämpfung von 3,5 dB///Schließlich hat jeder Splitter eine Dämpfung abhängig von den Eingangsports: Ausgangsports, zum Beispiel:",
  "ulx_1": "1 : 2 Splitter hat eine Dämpfung von 3,5 dB///1 : 4 Splitter hat eine Dämpfung von 7 dB///1 : 8 Splitter hat eine Dämpfung von 10,5 dB///1 : 16 Splitter hat eine Dämpfung von 14 dB///1 : 32 Splitter hat eine Dämpfung von 17,5 dB",
  "p36": "Die Summe all dieser Dämpfungswerte ergibt die Gesamtdämpfung im Netzwerk entlang des Kabels.",
  "h2_9": "Komponenten des Fasersteckers",
  "p37": "Die Aufgabe eines Fasersteckers besteht darin, das Faserende mechanisch mit einem Hardwareteil oder mit einer anderen Faser zu verbinden, damit die Kerne genau ausgerichtet sind und der kleinste Verlust entsteht.",
  "i13": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_10": "Geometrie",
  "p38": "Geometrie bezieht sich auf die Form der Ferrulen-Endfläche, wie dargestellt:",
  "i14": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p39": "Es gibt viele Arten von Steckern basierend auf der Geometrie, der Körper- und Kapazitätsgröße.",
  "p40": "Hier sind die verschiedenen Arten von Steckern für optische Fasern:",
  "i15": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_11": "Splicing von optischen Fasern",
  "p41": "Wenn wir zwei optische Faserkabel verbinden, müssen wir sicherstellen, dass die beiden Filamente, die gespleißt werden sollen, dieselben Eigenschaften in Bezug auf den Kern- und Manteldurchmesser, den Gesamtdurchmesser und die Brechungsindizes haben. Das Wichtigste ist, dass sie regelmäßig sind (mit einem Winkel von 90 Grad auf der Mittellinie des Kabels zugeschnitten) und frei von Staub und Rauch.",
  "h3_9": "Optischer Faserschneider",
  "p42": "Dieses Gerät wird verwendet, um die optischen Faserfilamente zu schneiden und die Schutzschicht der beiden verschiedenen Fasern zu entfernen, die gespleißt werden sollen.",
  "i16": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_10": "Optischer Spalter",
  "p43": "Dieses Gerät wird verwendet, um die beiden Enden der beiden Filamente, die gespleißt werden sollen, genau und ohne Schneidewinkel und schlechtes Schneiden zu spalten.",
  "i17": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p44": "Und so kann das Spalten aussehen:",
  "i18": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p45": "Der gespaltene Teil nach der Schutzschicht sollte etwa 20 mm bis 15 mm betragen.",
  "h2_12": "Spleißgeräte",
  "p46": "Das Ziel eines jeden optischen Faserspleißes ist es, zwei Faserenden dauerhaft miteinander zu verbinden, wobei so wenig Verlust an optischer Qualität wie möglich entsteht.",
  "p47": "Optische Fasern können auf zwei Arten gespleißt werden: mechanisches Spleißen und Fusionsspleißen.",
  "h3_11": "Mechanische Spleißgeräte",
  "p48": "Mechanische Spleißgeräte verwenden ein Kunststoffrohr mit einer Verriegelungsvorrichtung, die zwei Fasern gegeneinander hält, um einen Spleiß herzustellen, wie in Abbildung dargestellt.",
  "i19": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p49": "Die beiden gespleißten Enden werden dauerhaft in der gezeigten Vorrichtung gehalten.",
  "p50": "Diese Art des Spleißens hat mehr Dämpfung als das fusionierte Spleißen, und mechanische Spleißgeräte sind in der Regel kostengünstig, aber weniger funktionsreich.",
  "h3_12": "Fusionsspleißgeräte",
  "p51": "Fusionsspleißgeräte erzeugen einen dauerhaften Spleiß, indem sie die Faserenden mit einem elektrischen Lichtbogen miteinander verschweißen. Der Spleiß wird dann in Schrumpfschlauch eingehüllt, der in das Spleißgerät eingebaut ist. Die folgende Abbildung zeigt ein Fusionsspleißgerät:",
  "i20": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p52": "Fusionsspleißgeräte sind in der Regel teuer und kosten Tausende von Dollar. Sie haben viele Funktionen im Vergleich zu mechanischen Spleißgeräten, automatische Mechanismen zur Ausrichtung der beiden Faserenden, hochauflösende Bilder und Videos für die beiden Enden während des Spleißens und die Berechnung des Dämpfungswerts nach dem Spleißen, wie gezeigt.",
  "i21": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_13": "Spleißverfahren",
  "p53": "Da das Fusionsspleißen effektiver, präziser und gängiger ist, wenn es um Singlemode- und Fernkommunikationsnetzwerke geht, werden wir das Verfahren im Detail erläutern:",
  "h3_13": "Fusionsspleißverfahren",
  "p54": "Viele Fusionsspleißgeräte enthalten eine Funktion, die die Faserenden automatisch in die richtige Beziehung zueinander und zu den Elektroden bringt, um den bestmöglichen Spleiß zu erzielen. Der Bediener muss nur die Fasern ordnungsgemäß vorbereiten und sie in das Gerät legen.",
  "p55": "Zur Vorbereitung auf das Fusionsspleißen, wie auch beim mechanischen Spleißen, stellen Sie sicher, dass der Arbeitsbereich sauber, trocken und gut beleuchtet ist. Stellen Sie vor Beginn folgende Werkzeuge zusammen:",
  "ulx_2": "Fusionsspleißwerkzeug///Kunststoffbeschichtungsentferner///Reagenzgrad-Isopropylalkohol///Fussellose Tücher///Spleißgerät///Schrumpfschlauch",
  "p56": "Sobald Ihre Materialien zusammengeführt sind, fahren Sie mit den folgenden Schritten fort:",
  "h3_14": "Einrichtung",
  "ul_4": "1. Öffnen Sie die Faserpufferrohre und legen Sie die Fasern frei und reinigen Sie sie.///2. Schalten Sie das Fusionsspleißgerät ein.",
  "h3_15": "Faser-Vorbereitung",
  "ul_5": "3. Entfernen Sie von der Aufbewahrungsspule oder -spule die Mindestlänge der Faser, die erforderlich ist, um die Fasern vorzubereiten und zu splicen - weniger als eine Schleife, wenn möglich.///4. Schieben Sie den Schrumpfschlauch über ein Faserende und bewegen Sie ihn weit genug auf die Faser, um ihn aus dem Weg zu räumen.///5. Entfernen Sie etwa 25 bis 51 mm Kunststoffbeschichtung von der Faser mit einem mechanischen Schneidewerkzeug.///6. Reinigen Sie das nackte Glas, indem Sie die Faser durch ein mit Alkohol getränktes fusselfreies Tuch ziehen. Dadurch werden etwaige Fragmente oder Schmutzreste von der Faser entfernt.///7. Spalten Sie die Faser auf die vom Spleißgerät angegebene Länge, normalerweise 12–14 mm ± 0,5 mm. Hinweis: Die gespleißten Enden sollten innerhalb von 2° von senkrecht zur Faserachse sein und frei von Defekten.",
  "h3_16": "Spleißmontage",
  "ul_6": "8. Positionieren Sie ein Faserende in der Nähe der Elektrode in der Einheit und schließen Sie die Faserklemme neben der Elektrode.///9. Schließen Sie die äußere Klemme der Faser.///10. Wiederholen Sie die Schritte 7 und 8 für das andere Faserende, das gespleißt werden soll.///11. Schließen Sie die Elektrodenabdeckung.///12. Wählen Sie das geeignete Spleißprogramm in der Computersteuerung des Spleißers aus und aktivieren Sie es. Der Spleißer führt die notwendigen Kalibrierungen und Positionierungen durch, führt den Spleiß aus und misst den Verlust über den Spleiß hinweg. Die Operation kann über den Videomonitor angezeigt werden, wenn verfügbar, wie in der Abbildung gezeigt.",
  "i22": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_17": "Sichtbarer Fehlerlokalisator",
  "h2_14": "Messung von optischen Fasern",
  "p57": "Der VFL kann separat oder in einem OTDR (Optical Time Domain Reflectometer) eingebaut sein. Es ist ein Gerät, das einen Lichtstrahl in die Faser einspeist, um die Änderungen des Strahls zu verfolgen und die Mikrobiegungen oder Brüche zu lokalisieren, wie in den Abbildungen gezeigt:",
  "i23": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "i24": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_18": "OTDR (Optical Time Domain Reflectometer)",
  "p58": "Informationen, die gemessen werden können",
  "ol7": "Die Dämpfung.///Die Position von Fehlern anhand ihrer Entfernung von einem Ursprungspunkt.///Die Dämpfung in Bezug auf die Entfernung (dB/km).///Die Reflektanz eines reflektierenden Ereignisses oder einer Verbindung.",
  "p59": "Das Ziel dieses Instruments ist es, Ereignisse an jedem Ort im Faserlink zu erkennen, zu lokalisieren und zu messen.",
  "p60": "Das OTDR basiert auf dem Phänomen der Lichtstreuung innerhalb einer optischen Faser und erzeugt eine Beziehung, die das Verhalten des Lichts innerhalb der Faser anhand der Beziehung zwischen der Dämpfung und der Entfernung beschreibt, wie gezeigt:",
  "i25": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p61": "Wenn das Licht das Ende des Kabels erreicht, erzeugt es diese Schwingung, die am Ende dieses Diagramms erscheint, was darauf hinweist, dass es das Ende des Glasfaserkabels ist.",
  "h1_1": "Plesiochrones digitales Hierarchie",
  "p62": "In den frühen 1970er Jahren begannen digitale Übertragungssysteme aufzutauchen, die eine Methode namens Pulscodemodulation (PCM) verwendeten, die erstmals 1937 vorgeschlagen wurde. PCM ermöglichte es, analoge Wellenformen wie die menschliche Stimme in binärer Form darzustellen.",
  "h2_15": "Prinzipien der PDH-Multiplexierung",
  "p63": "PDH-Signale mit höherer Übertragungsrate werden durch Multiplexen mehrerer Signale niedrigerer Rate erhalten.",
  "h3_19": "Multiplex-Betrieb",
  "p64": "Vier Eingangssignale mit derselben Nennbitrate werden kombiniert, um ein Multiplexsignal zu bilden und dann über einen gemeinsamen Übertragungsweg zur Empfangsseite übertragen.",
  "h3_20": "Demultiplex-Betrieb",
  "p65": "Auf der Empfangsseite wird das Summensignal wieder auf die entsprechenden Ausgänge verteilt.",
  "i26": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p66": "Die obige Abbildung zeigt den Multiplexprozess von CEPT, der Standardmethode für die europäische Multiplexierung.",
  "p67": "Wie gezeigt, steht der Begriff PDH für Plesiochronous Digital Hierarchy. Es handelt sich um einen Rahmen, der eine Kombination von elektronischen Schaltungen verwendet, um Daten als Bitmuster von Nullen und Einsen zu senden. Er verwendet einen Kanal mit einer Rate von 1/8000 Sekunde, um Daten zu senden, und besteht aus 32 Steckplätzen, von denen jeder 8 Bits hat. Wenn wir das alles zusammenstellen, erhalten wir (8000 Sek * 32 Steckplätze * 8 Bit = 2,048 Mb/s), was die Taktrate dieses Rahmens ist.",
  "p68": "Durch das Multiplexen von Frames mit einer Bitrate von 2,048 Mb/s können wir eine höhere PDH-Rate wie in der Abbildung gezeigt erhalten.",
  "p69": "Diese Operation sollte auf der Sendeseite durchgeführt werden. Wenn es jedoch um den Empfang geht, muss eine Umkehrung des Demultiplex-Betriebs erfolgen, um die Daten zu lesen.",
  "i27": {
    "title": "",
    "alt": "",
    "description": "Dies ist das von CEPT verwendete System zur Erzielung hoher Übertragungsraten. Jeder bidirektionale Pfeil steht für einen PDH-Rahmen."
  },
  "h2_16": "Rahmenstruktur eines PDH-Signals",
  "p70": "Jedes Signal innerhalb einer CEPT-Hierarchieebene hat eine spezifische Rahmenstruktur, die im Wesentlichen aus den folgenden Blöcken besteht:",
  "i28": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_17": "Multiplexen / Demultiplexen von PDH-Signalen",
  "p71": "Das Multiplexen in PDH kann mit dem Bit-für-Bit-Multiplexen erfolgen, wie unten gezeigt:",
  "i29": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p72": "Wie gezeigt, besteht die Aufgabe eines Multiplexers darin, die beiden Frames in einem Frame zu kombinieren. Dieser neue Frame sollte eine Übertragungsrate haben, die der Summe der Frames I und II entspricht. Der CEPT-Standard erreichte die höchste Rate durch Multiplexen, nämlich 140 Mb/s.",
  "h2_18": "Nachteile von PDH",
  "p73": "Es gab tatsächlich einige Nachteile bei der Verwendung von PDH. Erstens mangelnde Flexibilität. Einfach ausgedrückt, können wir keine bestimmte niedrigere Rate extrahieren, wenn wir beispielsweise einem Kunden einen einzelnen 2-Mb/s-Kanal bereitstellen möchten. Um eine einzelne 2-Mb/s-Leitung zugänglich zu machen, muss der 140-Mb/s-Kanal vollständig demultiplexiert werden, um seine 64 Bestandteile von 2 Mb/s-Leitungen über 34 und 8 Mbit/s zu erhalten. Sobald die benötigte 2-Mb/s-Leitung identifiziert und extrahiert wurde, müssen die Kanäle dann wieder auf 140 Mbit/s multiplexiert werden.",
  "p74": "Eine weitere Einschränkung von PDH ist seine Unfähigkeit, verschiedene Topologien bereitzustellen, da es nur eine sehr grundlegende Punkt-zu-Punkt-Topologie bieten kann.",
  "p75": "Letzte Einschränkung: Es war nicht synchron, und daher gab es einige Probleme beim Multiplexen von Frames. Der Multiplexer geht davon aus, dass alle seine Eingänge gleichzeitig betrieben werden, genauer gesagt, das letzte Bit rechts in jedem Frame muss dem entsprechenden Bit im anderen Frame hinzugefügt werden. Wir könnten das durch die Verwendung eines Containers lösen, der eine größere Rate als alle Eingangsframes hat. Die Aufgabe dieses Containers besteht darin, alle Bits aufzunehmen, die sich aus dem Unterschied zwischen diesem Container und jedem Frame ergeben. Diese Bits werden Füllbits genannt, und PDH ist stark abhängig von Füllbits. Und dies ist ein weiteres Problem, da Füllbits mit Unsinn gefüllt sind, der keine Rolle an dem Demultiplex-Ende hat, außer Platz im Frame einzunehmen.",
  "h1_2": "Synchronous Digital Hierarchy",
  "p76": "Die Hauptfunktion eines Synchronous Digital Hierarchy (SDH)-Systems ist die Fähigkeit zur Synchronisation, und das ist eine Funktion, die PDH nicht erreichen konnte, da jeder Frame in PDH seine eigene Taktrate oder, mit anderen Worten, seinen eigenen Takterzeuger hat. Deshalb litt PDH unter unterschiedlichen Taktraten.",
  "p77": "Aber wenn wir ein System erstellen könnten, das einen Referenztakterzeuger hat, hätten wir eine einheitliche Taktrate für alle Frames, die multiplexiert werden sollen. Daher könnten wir die Füllbits loswerden.",
  "p78": "Ein weiterer Vorteil des SDH-Systems ist seine Struktur. Es besteht aus 9 Zeilen, wobei jede Zeile 270 Slots und jeder Slot 8 Bits hat. Daher beträgt die Gesamtzahl der Bits im SDH-Rahmen = 9 * 270 * 8 = 19440 Bit.",
  "p79": "Bisher so gut, lassen Sie uns jetzt versuchen, die Basisrate dieses Rahmens zu finden. Wie wir wissen, wird der Rahmen genau wie ein PDH-Rahmen 8000 Mal pro Sekunde wiederholt. Wenn wir die Anzahl der Bits multiplizieren, erhalten wir 19440 * 8000 = 155,52 Mb/s.",
  "p80": "Die ITU (Internationale Fernmeldeunion) hat ein Basissignal spezifiziert, das STM-1 (Synchronous Transport Module - 1) mit 155,520 Mb/s. Alle Multiplex-Ebenen im SDH sind positive ganze Vielfache dieses Basissignals 'STM-1', wie unten gezeigt:",
  "i30": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p81": "Das sind einfach die Raten eines SDH-Rahmens, angefangen von der Basisrate, die durch das Multiplexen von Frames erreicht wird.",
  "p82": "Hinweis: Das STM-4 ist das 4-fache eines STM-1-Rahmens, ebenso wie das STM-64 das 16-fache eines STM-4-Rahmens ist und umgekehrt.",
  "p83": "Die zweidimensionale Darstellung eines STM-1-Rahmens enthält 9 Zeilen mit jeweils 270 Bytes, wie gezeigt:",
  "i31": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p84": "Der STM-1-Rahmen besteht aus drei Blöcken:",
  "i32": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "ulx_3": "Pointer (PTR): zeigt die Startadresse der Tributinformation an.///Abschnitts-Overhead (SOH): zusätzliche Übertragungskapazität.///Payload: Tributinformation.",
  "p85": "Der „Abschnitts-Overhead“ und der Zeiger dienen der Verwaltung, und die Nutzlasten dienen den Daten.",
  "p86": "Die Frames werden in Intervallen von 125 μs übertragen. Der STM-1-Rahmen wird (1 Sekunde: 125 μs) = 8000 Mal pro Sekunde wiederholt. Daher hat jedes Byte in einem STM-1-Rahmen eine Übertragungskapazität von 8000 * 8 = 64 kb/s, wie zuvor im PDH-Rahmen zitiert.",
  "p87": "Ein weiterer Vorteil von SDH gegenüber PDH ist, dass es Byte-für-Byte-Multiplexing verwendet, im Gegensatz zu PDH, das Bit-für-Bit-Multiplexing verwendet.",
  "p88": "Für ein besseres Verständnis wurde die Erzeugung eines STM-4-Rahmens hier mit nur 2 STM-1-Rahmen erklärt, obwohl in der Praxis 4 STM-1-Rahmen multiplexiert werden.",
  "i33": {
    "title": "Byte-für-Byte-Multiplexing.",
    "alt": "Byte-für-Byte-Multiplexing.",
    "description": "Byte-für-Byte-Multiplexing."
  },
  "h2_19": "Zusammenfassung",
  "h2_20": "Prinzipien der PDH-Multiplexierung",
  "ul_7": "Bitraten gemäß CEPT: 2 Mbit/s, 8 Mbit/s, 34 Mbit/s und 140 Mbit/s.///Jedes Signal hat eine separate Rahmenstruktur.///PDH basiert auf Bit-für-Bit-Multiplexing.///Keine Rahmensynchronisation der Eingangssignale der Tributär.///Die Eingangssignale der Tributär sind plesiochron zueinander, das heißt, ihre Taktraten haben den gleichen Nennwert, aber es gibt dennoch eine leichte Abweichung zwischen den beiden.",
  "h2_21": "Prinzipien der SDH-Multiplexierung",
  "ul_8": "Bitraten über 140 Mbit/s werden im Gegensatz zu PDH weltweit standardisiert.///Sowohl synchroner als auch plesiochroner Betrieb ist möglich.///Alle aktuellen PDH-Signale (CEPT/ANSI) können innerhalb des SDH übertragen werden (außer 8 Mb/s).///Die 'Abschnitts-Overhead'-Bytes bieten eine hohe Übertragungskapazität für Überwachungs-, Wartungs- und Steueraufgaben.///Hochwertige Multiplexsignale sind ganze Vielfache der Grundbitrate (155,520 Mb/s).///Zum ersten Mal ist der optische Leitungscode weltweit standardisiert."
}
