{
  "articleTitle": "Детали стажировки в Telecom Egypt",
  "date": "10 июля 2021 г.",
  "p1": "Без сомнения, оптические волокна и их технологии привели мир к гораздо более быстрым и надежным системам связи, будь то в терминах передачи, радио- и телевизионных услуг или даже интернета.",
  "p2": "Если мы взглянем назад на старые времена, мы обнаружим, что скорость интернета была недоступной для сравнения с современными скоростями и тактовыми частотами. Это произошло из-за новых технологий, которые смогли применить оптические волоконные сети вместо старых медных сетей.",
  "p3": "На самом деле, если мы попытаемся сосредоточиться больше, мы увидим, что современный интернет и компьютерные сети полностью зависят от систем связи и передачи данных с использованием физических сетей, состоящих из медных проводов или оптических волоконных кабелей.",
  "p4": "Важность оптических волоконных сетей подчеркнулась, когда объем данных рос огромными темпами, и потребность в высокой производительности и таких приложениях, как онлайн-игры и фрилансинг и т. д. Все это привело к тому, что пользователям требовалось гораздо больше пропускной способности для обмена, загрузки и скачивания данных. И это невозможно без стабильной и мощной сети.",
  "p5": "Медные кабели всегда имели ограничения в пропускной способности и передаче данных на большие расстояния. В этот момент нам пришлось найти более мощные кабели, способные нести больше пропускной способности с более высокой скоростью, что я и продемонстрирую в этой статье.",
  "i1": {
    "title": "",
    "alt": "Таблица, показывающая сравнение между оптоволокном и медью.",
    "description": "Сравнение медных и оптоволоконных кабелей."
  },
  "p6": "Основное преимущество, делающее оптический волоконный кабель более преимущественным перед медным, - это его скорость. Как мы все знаем, скорость света - это самая высокая скорость в нашей вселенной согласно относительности Эйнштейна, с постоянной скоростью 300 000 км/с в вакууме, в то время как скорость электрона через проводник составляет около 2200 км/с. Мы видим огромную разницу, и если бы мы могли создать систему, основанную на скорости света для передачи данных, это вызвало бы большое движение в мире передачи данных и связи, это именно «Оптические волоконные кабели».",
  "p7": "Как мы уже упомянули выше, оптический волоконный кабель зависит от скорости света, что означает, что он передает световой сигнал.",
  "p8": "Основные компоненты оптической коммуникационной системы:",
  "i2": {
    "title": "",
    "alt": "Схема, показывающая, как сигналы проходят через волоконные кабели от отправителя к получателю.",
    "description": ""
  },
  "h3_1": "Преимущества оптоволокна перед медными кабелями",
  "ol1": "Значительно увеличенная пропускная способность и емкость.///Меньшее ослабление сигнала.///Отсутствие перекрестных помех.///Меньшие уровни ошибок бит.///Трудность подключения.///Отсутствие электромагнитных помех.///Устойчивость к электрическим полям.///Уменьшенный размер и вес кабелей.///Защита окружающей среды.///Устойчивость к радиации (гамма-излучению) и коррозии.///Устойчивость к изменению температуры.///Низкая стоимость.",
  "h3_2": "Применение оптоволокна",
  "ol2": "Компьютерные сети.///Телефонные линии.///Медицинские применения.///Подводная связь.///Электростанции.///Военное применение.",
  "h2_1": "Природа света",
  "p9": "Свет обычно описывается одним из трех способов:",
  "h2_2": "1- Лучи",
  "p10": "В классической физике, которую многие из нас изучали в школе, свет состоял из «лучей», которые могли отражаться и преломляться через зеркала и призмы и т. д. Это хорошее описание в пределах его применимости, но оно не может объяснить многие явления, которые мы используем в оптической связи.",
  "i3": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_3": "2- Фотоны",
  "p11": "Во многих контекстах свет ведет себя так, как будто состоит из крошечных частиц, называемых «фотонами».",
  "h2_4": "3- Электромагнитные волны",
  "p12": "Весь свет представляет собой форму электромагнитной энергии. Но что такое электромагнитная энергия? Электромагнитная энергия излучается любым объектом, температура которого выше абсолютного нуля (–273° C), что означает, что атомы в объекте находятся в движении. Электроны, орбитально двигающиеся вокруг атомов, получают энергию от движения, и эта энергия заставляет их переходить на более высокие орбиты или энергетические уровни. Когда они возвращаются на свои исходные энергетические уровни, они снова высвобождают энергию. Энергия принимает две формы: электрическое поле и магнитное поле, образующееся под прямыми углами друг к другу и под прямыми углами к их пути движения, как показано на рисунке.",
  "i4": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p13": "Длины волн, наиболее часто используемые для оптических волокон, находятся в инфракрасном диапазоне со значениями 850 нм, 1310 нм и 1550 нм.",
  "p14": "Спектральный диапазон этих длин волн обеспечивает важное сочетание характеристик:",
  "p15": "он достаточно высок для обеспечения высоких скоростей передачи данных, но достаточно низок, чтобы требовалась относительно низкая мощность для передачи на большие расстояния.",
  "i5": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p16": "Эти конкретные длины волн были выбраны, так как они обеспечивают наивысшие скорости передачи данных при наименьшем потреблении энергии.",
  "p17": "Скорость света в среде зависит от показателя преломления этой среды, мы видим, что скорость света изменяется в зависимости от среды",
  "p18": "v = c / n",
  "p19": "Где: n - показатель преломления материала, c - скорость света в вакууме, v - скорость света через материал.",
  "p20": "И на этом рисунке показана скорость света через различные среды",
  "i6": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_5": "Структура оптического волокна:",
  "p21": "Но какова на самом деле структура оптического волоконного кабеля?",
  "p22": "Оптический волоконный кабель состоит из трех компонентов:",
  "ol3": "Ядро///Оплетка///Оболочка",
  "ul_1": "Ядро можно представить как очень длинный твердый стержень из стекла.///Оплетка - это оболочка, обернутая вокруг ядра, также сделанная из стекла, с показателем преломления меньшим, чем у ядра.///Оболочка - это защитный слой, сделанный из пластика, чтобы защитить от пыли, жидкостей и света снаружи.",
  "i7": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p23": "Обратите внимание, что показатель преломления оплетки больше, чем показатель преломления ядра. И на рисунке показаны только ядро и оплетка без оболочки.",
  "i8": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_3": "Критический угол:",
  "p24": "Как показано на рисунке выше, критический угол - это угол, на который световой луч должен быть направлен к ядру в начале кабеля, чтобы обеспечить полное внутреннее отражение. Этот угол можно рассчитать по формуле:",
  "p25": "θc = arcsin(n2 ÷ n1)",
  "p26": "Пример: если мы хотим узнать критический угол оптического волокна с показателем преломления ядра n1 = 1,51 и показателем преломления оплетки n2 = 1,46:",
  "p27": "θc = arcsin(1,46 ÷ 1,51) = 75,211°",
  "h2_6": "Типы оптических волокон:",
  "h3_4": "1- Одномодовые оптические волокна:",
  "p28": "Одномодовые волокна используются для подключения на большие расстояния. Как следует из названия, они имеют только один режим (один луч света с одной длиной волны). Преимущества одномодовых оптических волокон следующие:",
  "ol4": "Используются для передачи и коммуникации между разными точками обмена.///Используются для больших расстояний, так как имеют меньшее ослабление, чем многомодовые.///Передают один луч света.///Устройство, которое создает этот луч света, в основном состоит из лазерного диода, и поэтому это одномодовое волокно.///Диаметр одномодового волокна составляет 250 мкм, ядро - 9 мкм, оплетка - 125 мкм, оболочка - 250 мкм.",
  "h3_5": "2- Многомодовые оптические волокна:",
  "p29": "Многомодовые оптические волокна обычно используются для подключения на короткие расстояния, и, как и в одномодовых, они могут иметь множество режимов (лучей света с разными длинами волн), и преимущества многомодовых оптических волокон следующие:",
  "ol5": "Используются для передачи и коммуникации только на коротких расстояниях, таких как между шкафом и клиентом, обычно менее 2 километров.///Используются для коротких расстояний, так как имеют большее ослабление, чем одномодовые.///Могут нести несколько лучей света с разными длинами волн.///Устройство, которое создает эти лучи света, в основном состоит из светодиода (светодиодного излучателя).///Диаметр многомодового волокна составляет 250 мкм, ядро - 50-62 мкм, оболочка - 250 мкм.",
  "h2_7": "Ослабление",
  "p30": "Существует три причины, вызывающие ослабление внутри оптического волокна:",
  "h3_6": "Поглощение",
  "p31": "Все материалы, даже самое прозрачное стекло, поглощают свет. Количество поглощения зависит от типа материала и длины волны света, проходящего через него.",
  "i9": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_7": "Рассеяние",
  "p32": "Рассеяние вызвано атомными структурами и частицами в волокне, перенаправляющими свет, попавший на них, как показано на рисунке.",
  "i10": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_8": "Потери при изгибе",
  "ul_2": "Микроизгибы",
  "i11": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "ul_3": "Макроизгибы",
  "i12": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_8": "Общие потери",
  "p33": "Общие потери - это комбинация эффектов поглощения и рассеяния в волокне.",
  "p34": "Сначала определим понятие потерь. В оптических волокнах потери означают уменьшение мощности в зависимости от различных параметров на всей длине кабеля от точки обмена до клиента.",
  "p35": "Давайте рассмотрим некоторые параметры, по которым мы теряем мощность на всем пути:",
  "ol6": "Каждая точка соединения имеет приблизительное ослабление около 0,1 дБ.///Ослабление на каждый километр зависит от длины волны, которую мы используем.///Каждые 4 километра мы должны иметь точку соединения, потому что волоконные ролики делаются длиной 4 километра, поэтому нам нужно иметь точку соединения каждые 4 километра.///Каждый коннектор на волокне имеет максимальное ослабление около 0,5 дБ.///Каждая ОРП (Оптическая Распределительная Панель) имеет ослабление около 3,5 дБ.///И, наконец, каждый делитель имеет ослабление в зависимости от входных портов : выходных портов, например:",
  "ulx_1": "1 : 2 делитель имеет ослабление = 3,5 дБ.///1 : 4 делитель имеет ослабление = 7 дБ.///1 : 8 делитель имеет ослабление = 10,5 дБ.///1 : 16 делитель имеет ослабление = 14 дБ.///1 : 32 делитель имеет ослабление = 17,5 дБ.",
  "p36": "Сумма всех этих значений ослабления дает нам общие потери в сети по всей длине кабеля.",
  "h2_9": "Компоненты оптического разъема",
  "p37": "Задачей оптического разъема является механическое соединение конца волокна с аппаратурой или другим волокном так, чтобы сердцевины точно выравнивались и производили минимальные потери.",
  "i13": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_10": "Геометрия",
  "p38": "Геометрия относится к форме торцевой части ферулы, как показано:",
  "i14": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p39": "Существует много типов разъемов на основе геометрии, размеров корпуса и колпачка.",
  "p40": "Вот различные типы разъемов оптических волокон:",
  "i15": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_11": "Сплайсинг оптических волокон",
  "p41": "Когда мы соединяем два оптических волоконных кабеля, мы должны убедиться, что две волоконные нити, которые мы собираемся соединить, имеют одинаковые характеристики в отношении диаметра сердцевины и оболочки, общего диаметра, показателей преломления, а самое главное - они должны быть ровными (со срезанным углом 90 градусов по центральной линии кабеля) и свободными от пыли и дыма.",
  "h3_9": "Снятие оптических волокон",
  "p42": "Это оборудование используется для удаления покрытия с оптических нитей и удаления защитного слоя с двух разных волокон, которые будут соединены.",
  "i16": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_10": "Оптический кливер",
  "p43": "Это оборудование используется для точного разрезания двух концов двух нитей для соединения без каких-либо углов разделки и плохой разделки.",
  "i17": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p44": "И вот как это может выглядеть при разделке:",
  "i18": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p45": "Обрезанная часть после снятия покрытия должна быть примерно 20 мм до 15 мм.",
  "h2_12": "Оборудование для сплайсинга",
  "p46": "Целью любого сплайса оптического волокна является постоянное соединение двух концов волокон с минимальными потерями качества света.",
  "p47": "Оптические волокна могут быть сплайсированы двумя способами: механическим сплайсингом и сварочным сплайсингом.",
  "h3_11": "Механические сплайсеры",
  "p48": "Механические сплайсеры используют пластиковую трубку с механизмом блокировки, который удерживает два волокна друг против друга, чтобы создать сплайс, как показано на рисунке.",
  "i19": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p49": "Оба сплайсированных терминала навсегда удерживаются в показанной фиксации механически.",
  "p50": "Этот способ сплайсинга имеет больше потерь, чем сварочный сплайсинг, и механические сплайсеры обычно недороги, но имеют меньше функций.",
  "h3_12": "Сварочные сплайсеры",
  "p51": "Сварочные сплайсеры создают постоянный сплайс путем сваривания концов волокна друг с другом с помощью электрической дуги. Затем сплайс заключается в термоусаживаемую трубку с печью, встроенной в сварочный аппарат. На следующем рисунке показан сварочный сплайсер:",
  "i20": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p52": "Сварочные сплайсеры обычно дороги и стоят тысячи долларов, они имеют гораздо больше функций, чем механические сплайсеры: автоматический механизм для выравнивания двух концов волокна, высококачественные изображения и видео для двух концов при сплайсинге, а также возможность вычисления значения ослабления после сплайса, как показано.",
  "i21": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_13": "Процедуры сплайсинга",
  "p53": "Так как сварочный сплайсинг намного эффективнее, точнее и распространеннее в случае одномодовых и длиннодистанционных сетей связи, мы рассмотрим его процедуру подробно:",
  "h3_13": "Процедура сварочного сплайсинга",
  "p54": "Многие сварочные сплайсеры имеют функцию автоматической позиционировки концов волокна в правильном отношении друг к другу и к электродам для наилучшего возможного сплайса. Оператору требуется только правильно подготовить волокна и поместить их в устройство.",
  "p55": "Для подготовки к сварочному сплайсингу, как и при механическом сплайсинге, убедитесь, что рабочая область чистая, сухая и хорошо освещена. Подготовьте следующие инструменты перед началом:",
  "ulx_2": "Инструмент для сварочного сплайсинга///Стриппер для пластикового покрытия///Изопропиловый спирт высшей степени очистки///Беспыльные салфетки///Кливер///Термоусаживаемая трубка",
  "p56": "После того как ваши материалы собраны, продолжайте с выполнением следующих шагов:",
  "h3_14": "Настройка",
  "ul_4": "1. Откройте трубки с защитной оболочкой волокон и выставите волокна и очистите их.///2. Включите питание сварочного сплайсера.",
  "h3_15": "Подготовка волокон",
  "ul_5": "3. Снимите с бобины минимальную длину волокна, необходимую для подготовки и сплайса волокон — меньше одного петельного витка, если это возможно.///4. Переместите термоусаживаемую трубку на один конец волокна и передвиньте ее достаточно высоко, чтобы она не мешала.///5. Снимите примерно 1 до 2 дюймов (25 мм до 51 мм) пластикового покрытия с волокна с помощью механического стриппера.///6. Очистите обнаженное стекло, протянув волокно через салфетку, смоченную изопропиловым спиртом. Это удаляет любые остатки или грязь на волокне.///7. Разделите волокно на длину, указанную брендом сплайсера, который вы используете, обычно 12–14 мм ± 0,5 мм. Примечание: Разделенные концы должны находиться под углом не более 2° к перпендикулярной оси волокна и быть без дефектов.",
  "h3_16": "Сборка сплайса",
  "ul_6": "8. Разместите один конец волокна в устройстве около электрода и закройте зажим волокна рядом с электродом.///9. Закройте внешний зажим на волокне.///10. Повторите шаги 7 и 8 для другого конца волокна, которое будет сплайсировано.///11. Закройте крышку электрода.///12. Выберите подходящую программу сварки в компьютерном управлении сплайсера и активируйте ее. Сплайсер выполняет необходимую калибровку и позиционирование, выполняет сплайс и измеряет потери через сплайс. Работу можно наблюдать через видеомонитор, если он доступен, как показано на рисунке.",
  "i22": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_17": "Видимый поисковик дефектов",
  "h2_14": "Измерение оптического волокна",
  "p57": "VFL может быть отдельным устройством или встроенным в ОТДР (оптический временной доменный рефлектометр). Это устройство вводит луч света внутрь волокна для отслеживания изменений луча и определения микроизгибов или обрывов, как показано на рисунках:",
  "i23": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "i24": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h3_18": "ОТДР (оптический временной доменный рефлектометр)",
  "p58": "Информация, которую можно измерить",
  "ol7": "Ослабление.///Местоположение дефектов по расстоянию от точки начала.///Ослабление относительно расстояния (дБ/км).///Отражение от отражательного события или связи.",
  "p59": "Цель этого прибора - обнаружить, определить и измерить события в любом месте на оптическом волоконном кабеле.",
  "p60": "ОТДР зависит от явления рассеивания света внутри оптического волокна и генерирует отношение, описывающее поведение света внутри волокна в зависимости от отношения между ослаблением и расстоянием, как показано:",
  "i25": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p61": "Когда свет достигает конца кабеля, он создает эту осцилляцию, которая появляется в конце этого графика, указывая на конец волоконного кабеля.",
  "h1_1": "Плезиохронная цифровая иерархия",
  "p62": "В начале 1970-х годов начали появляться цифровые передающие системы, использующие метод, известный как модуляция импульсного кода (PCM), впервые предложенный в 1937 году. PCM позволял аналоговым волнообразам, таким как голос человека, представляться в двоичной форме.",
  "h2_15": "Принципы мультиплексирования ПДХ",
  "p63": "Сигналы ПДХ с более высокой скоростью передачи получаются путем мультиплексирования нескольких сигналов более низкой скорости.",
  "h3_19": "Операция мультиплексирования",
  "p64": "Четыре входных сигнала с одинаковой номинальной битовой скоростью объединяются в один мультиплексный сигнал, который затем передается на сторону приема через один общий путь передачи.",
  "h3_20": "Операция демультиплексирования",
  "p65": "На стороне приема суммарный сигнал снова распределяется по соответствующим выходам.",
  "i26": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p66": "На приведенной выше фигуре показан процесс мультиплексирования CEPT, стандартного метода европейского мультиплексирования.",
  "p67": "Как мы видим, термин ПДХ - это аббревиатура от Плезиохронная Цифровая Иерархия. Это кадр, который использует сочетание электронных схем для отправки данных в виде битовых последовательностей нулей и единиц, он использует канал со скоростью 1/8000 секунды для передачи данных и состоит из 32 слотов, каждый слот содержит 8 бит. Если мы объединим все это вместе, то получим (8000 сек * 32 слота * 8 бит = 2,048 Мб/с), что является тактовой частотой этого кадра.",
  "p68": "Мультиплексированием кадров с битовой скоростью 2,048 Мб/с мы сможем получить более высокую скорость ПДХ, как показано на рисунке.",
  "p69": "Эта операция должна выполняться на стороне отправки, но когда дело доходит до приема, должна быть обратная операция демультиплексирования для чтения данных.",
  "i27": {
    "title": "",
    "alt": "",
    "description": "Это система, используемая CEPT для получения высокой скорости передачи. Каждая двусторонняя стрелка обозначает кадр ПДХ."
  },
  "h2_16": "Структура кадра ПДХ",
  "p70": "Каждый сигнал на уровне иерархии CEPT имеет специфическую структуру кадра, которая в основном состоит из следующих блоков:",
  "i28": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "h2_17": "Мультиплексирование / Демультиплексирование сигналов ПДХ",
  "p71": "Мультиплексирование в ПДХ может быть выполнено с использованием мультиплексирования битов на бит, как показано ниже:",
  "i29": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p72": "Как показано, задачей мультиплексора является объединение двух кадров в один кадр, новый кадр должен иметь скорость передачи, равную сумме скоростей кадров I и II вместе. Стандарт CEPT смог достичь максимальной скорости с использованием мультиплексирования, которая составляет 140 Мб/с.",
  "h2_18": "Недостатки ПДХ",
  "p73": "На самом деле у ПДХ были некоторые недостатки, прежде всего отсутствие гибкости, просто говоря, мы не можем извлечь определенную более низкую скорость, если мы хотим, например, предоставить клиенту отдельный канал 2 Мб/с. Чтобы получить отдельную линию 2 Мб/с, 140 Мб/с канал должен быть полностью демультиплексирован на его 64 составляющих линии 2 Мб/с через 34 и 8 Мб/с. После того как требуемая линия 2 Мб/с была определена и извлечена, каналы должны затем быть снова мультиплексированы до 140 Мб/с.",
  "p74": "Другое ограничение ПДХ - его неспособность предоставлять разные топологии, так как он может предоставлять только базовую точка-точка топологию.",
  "p75": "Последнее ограничение заключается в том, что он не был синхронным, и, следовательно, у него были некоторые проблемы при мультиплексировании кадров, так как мультиплексор предполагает, что все его входы работают одновременно, более ясно, последний бит справа внутри каждого кадра должен быть добавлен к соответствующему биту в другом кадре. Мы могли бы решить эту проблему, используя контейнер с более высокой скоростью, чем у всех входных кадров, и задача этого контейнера - заполнять все биты, полученные из разницы между этим контейнером и каждым кадром, эти биты называются заполняющими битами, и ПДХ в значительной степени зависит от заполняющих битов. И это также проблема, потому что заполняющие биты заполняются абсурдом, который не имеет никакой роли на конце демультиплексации, за исключением занимаемого пространства внутри кадра.",
  "h1_2": "Синхронная цифровая иерархия",
  "p76": "Основной особенностью системы синхронной цифровой иерархии является способность быть синхронной, и это особенность, которую ПДХ не мог достичь, так как каждый кадр в ПДХ имеет свою собственную тактовую частоту, или другими словами, свой собственный генератор тактовой частоты, поэтому ПДХ страдал от разных тактовых частот.",
  "p77": "Но если бы мы могли создать систему, имеющую генератор эталонной тактовой частоты, у нас была бы однородная тактовая частота для всех кадров, подлежащих мультиплексированию, следовательно, мы могли бы избавиться от заполняющих битов.",
  "p78": "Еще одним преимуществом системы СДХ является ее структура, она состоит из 9 строк, каждая строка содержит 270 слотов, и каждый слот содержит 8 бит. Таким образом, общее количество битов в кадре СДХ = 9 * 270 * 8 = 19440 бит.",
  "p79": "Пока все хорошо, давайте теперь попробуем найти базовую скорость этого кадра. Как мы знаем, кадр подобен кадру ПДХ, он повторяется 8000 раз в секунду, так что если мы умножим количество битов, то получим 19440 * 8000 = 155.52 Мб/с.",
  "p80": "МСЭ (Международный союз электросвязи) установил базовый сигнал, STM-1 (Синхронный Транспортный Модуль - 1) со скоростью 155,520 Мб/с. Все уровни мультиплексирования в СДХ являются положительными целыми кратными этому базовому сигналу 'STM-1', как показано ниже:",
  "i30": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p81": "Это просто скорости кадров СДХ, начиная с базовой скорости и до более высоких скоростей, полученных мультиплексированием кадров.",
  "p82": "Примечание: STM-4 - это 4 кратные кадра STM-1, аналогично, STM-64 - это 16 кратных кадров STM-4 и наоборот.",
  "p83": "Двумерное представление кадра STM-1 включает 9 строк с 270 байтами в каждой, как показано:",
  "i31": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "p84": "Кадр STM-1 состоит из трех блоков:",
  "i32": {
    "title": "",
    "alt": "",
    "description": ""
  },
  "ulx_3": "Указатель (PTR): указывает на начальный адрес информации подвластной.///Служебные байты 'Section OverHead' (SOH): дополнительная пропускная способность для мониторинга, обслуживания и управления.///Полезная нагрузка: информация подвластной.",
  "p85": "'Section OverHead' и Указатель предназначены для управления, а полезная нагрузка предназначена для данных.",
  "p86": "Кадры передаются в интервалах по 125 мкс. Кадр STM-1 повторяется (1 с: 125 мкс) = 8000 раз в секунду. Таким образом, каждый байт в кадре STM-1 имеет пропускную способность 8000 * 8 = 64 кб/с, как мы уже упоминали ранее в кадре ПДХ.",
  "p87": "Еще одним преимуществом СДХ перед ПДХ является то, что она использует мультиплексирование байт за байтом, в отличие от ПДХ, которая использует мультиплексирование бит за битом.",
  "p88": "Для лучшего понимания, здесь было объяснено создание кадра STM-4 с использованием всего 2 кадров STM-1, хотя на практике мультиплексируются 4 кадра STM-1.",
  "i33": {
    "title": "Мультиплексирование байт за байтом.",
    "alt": "Мультиплексирование байт за байтом.",
    "description": "Мультиплексирование байт за байтом."
  },
  "h2_19": "Резюме",
  "h2_20": "Принципы мультиплексирования ПДХ",
  "ul_7": "Скорости в соответствии с CEPT: 2 Мб/с, 8 Мб/с, 34 Мб/с и 140 Мб/с.///Каждый сигнал имеет свою собственную структуру кадра.///ПДХ зависит от мультиплексирования бит за битом.///Нет синхронизации кадров сигналов подвластных.///Входные сигналы подвластных сигналов плезиохронны друг к другу, другими словами, их тактовые частоты имеют одинаковое номинальное значение, но существует небольшое отклонение между ними.",
  "h2_21": "Принципы мультиплексирования СДХ",
  "ul_8": "Скорости выше 140 Мб/с стандартизированы на всемирной основе, в отличие от ПДХ.///Возможна как синхронная, так и плезиохронная работа.///Все текущие сигналы ПДХ (CEPT/ANSI) могут передаваться в СДХ (за исключением 8 Мб/с).///Байты 'Section OverHead' предоставляют высокую пропускную способность для мониторинга, обслуживания и управления.///Высокоуровневые мультиплексные сигналы являются целыми кратными базовой скорости (155,520 Мб/с).///Впервые оптический линейный код стандартизирован всемирно."
}
